[
  "table-editor-obsidian",
  "calendar",
  "find-unlinked-files",
  "code-block-copy",
  "privacy-glasses",
  "periodic-notes",
  "obsidian-latex-suite",
  "better-word-count",
  "obsidian-excel-to-markdown-table",
  "dataview",
  "obsidian-linter",
  "oz-clear-unused-images",
  "obsidian-paste-image-rename",
  "obsidian-image-auto-upload-plugin"
]